const z = `
Як умру, то поховайте
Мене на могилі,
Серед степу широкого,
На Вкраїні милій,
Щоб лани широкополі,
І Дніпро, і кручі
Було видно, було чути,
Як реве ревучий.

Як понесе з України
У синєє море
Кров ворожу... отоді я
І лани і гори —
Все покину і полину
До самого бога
Молитися... А до того —
Я не знаю бога.

Поховайте та вставайте.
Кайдани порвіте
І вражою злою кров'ю
Волю окропіте.
І мене в сім'ї великій,
В сім'ї вольній, новій
Не забудьте пом'янути
Незлим тихим словом.
`.trim();

const fixedZ = z
    .replaceAll('\'', '')
    .replaceAll('ʼ', '')
    .replaceAll('в', 'v')
    .replaceAll('є', 'іе')
    .replaceAll('ж', 'шз')
    .replaceAll('ї', 'іі')
    .replaceAll('й', 'і')
    .replaceAll('ц', 'тс')
    .replaceAll('щ', 'шч')
    .replaceAll('ю', 'іу')
    .replaceAll('я', 'іа')
    .replaceAll('В', 'V')
    .replaceAll('Є', 'Іе')
    .replaceAll('Ж', 'Шз')
    .replaceAll('Ї', 'Іі')
    .replaceAll('Й', 'І')
    .replaceAll('Ц', 'Тс')
    .replaceAll('Щ', 'Шч')
    .replaceAll('Ю', 'Іу')
    .replaceAll('Я', 'Іа');

console.log(fixedZ);