const fs = require("node:fs");

function getIcon(symbol) {
    const icon = fs.readFileSync(`./іконки/${symbol}.svg`, "utf-8");
    return `<div style="height: 14px; width: 14px; display: flex; align-items: center;">${icon.replaceAll('\n', '')}</div>`;
}

const charDefinitions = [
    ['0', "Нуль", getIcon('0')],
    ['1', "Один", getIcon('1')],
    ['2', "Два", getIcon('2')],
    ['3', "Три", getIcon('3')],
    ['4', "Чотири", getIcon('4')],
    ['5', "Пʼять", getIcon('5')],
    ['6', "Шість", getIcon('6')],
    ['7', "Сім", getIcon('7')],
    ['8', "Вісім", getIcon('8')],
    ['9', "Девʼять", getIcon('9')],

    ['А', "Велика буква \"А\"", getIcon('А')],
    ['Б', "Велика буква \"Б\"", getIcon('Б')],
    ['В', "Велика буква \"В\"", getIcon('В')],
    ['Г', "Велика буква \"Г\"", getIcon('Г')],
    ['Д', "Велика буква \"Д\"", getIcon('Д')],
    ['Е', "Велика буква \"Е\"", getIcon('Е')],
    ['Є', "Велика буква \"Є\"", getIcon('Є')],
    ['Ж', "Велика буква \"Ж\"", getIcon('Ж')],
    ['З', "Велика буква \"З\"", getIcon('З')],
    ['И', "Велика буква \"И\"", getIcon('И')],
    ['І', "Велика буква \"І\"", getIcon('І')],
    ['Ї', "Велика буква \"Ї\"", getIcon('Ї')],
    ['Й', "Велика буква \"Й\"", getIcon('Й')],
    ['К', "Велика буква \"К\"", getIcon('К')],
    ['Л', "Велика буква \"Л\"", getIcon('Л')],
    ['М', "Велика буква \"М\"", getIcon('М')],
    ['Н', "Велика буква \"Н\"", getIcon('Н')],
    ['О', "Велика буква \"О\"", getIcon('О')],
    ['П', "Велика буква \"П\"", getIcon('П')],
    ['Р', "Велика буква \"Р\"", getIcon('Р')],
    ['С', "Велика буква \"С\"", getIcon('С')],
    ['Т', "Велика буква \"Т\"", getIcon('Т')],
    ['У', "Велика буква \"У\"", getIcon('У')],
    ['Ф', "Велика буква \"Ф\"", getIcon('Ф')],
    ['Х', "Велика буква \"Х\"", getIcon('Х')],
    ['Ц', "Велика буква \"Ц\"", getIcon('Ц')],
    ['Ч', "Велика буква \"Ч\"", getIcon('Ч')],
    ['Ш', "Велика буква \"Ш\"", getIcon('Ш')],
    ['Щ', "Велика буква \"Щ\"", getIcon('Щ')],
    ['Ь', "Велика буква \"Ь\"", getIcon('Ь')],
    ['Ю', "Велика буква \"Ю\"", getIcon('Ю')],
    ['Я', "Велика буква \"Я\"", getIcon('Я')],

    ['а', "Мала буква \"а\"", getIcon('а')],
    ['б', "Мала буква \"б\"", getIcon('б')],
    ['в', "Мала буква \"в\"", getIcon('в')],
    ['г', "Мала буква \"г\"", getIcon('г')],
    ['д', "Мала буква \"д\"", getIcon('д')],
    ['е', "Мала буква \"е\"", getIcon('е')],
    ['є', "Мала буква \"є\"", getIcon('є')],
    ['ж', "Мала буква \"ж\"", getIcon('ж')],
    ['з', "Мала буква \"з\"", getIcon('з')],
    ['и', "Мала буква \"и\"", getIcon('и')],
    ['і', "Мала буква \"і\"", getIcon('і')],
    ['ї', "Мала буква \"ї\"", getIcon('ї')],
    ['й', "Мала буква \"й\"", getIcon('й')],
    ['к', "Мала буква \"к\"", getIcon('к')],
    ['л', "Мала буква \"л\"", getIcon('л')],
    ['м', "Мала буква \"м\"", getIcon('м')],
    ['н', "Мала буква \"н\"", getIcon('н')],
    ['о', "Мала буква \"о\"", getIcon('о')],
    ['п', "Мала буква \"п\"", getIcon('п')],
    ['р', "Мала буква \"р\"", getIcon('р')],
    ['с', "Мала буква \"с\"", getIcon('с')],
    ['т', "Мала буква \"т\"", getIcon('т')],
    ['у', "Мала буква \"у\"", getIcon('у')],
    ['ф', "Мала буква \"ф\"", getIcon('ф')],
    ['х', "Мала буква \"х\"", getIcon('х')],
    ['ц', "Мала буква \"ц\"", getIcon('ц')],
    ['ч', "Мала буква \"ч\"", getIcon('ч')],
    ['ш', "Мала буква \"ш\"", getIcon('ш')],
    ['щ', "Мала буква \"щ\"", getIcon('щ')],
    ['ь', "Мала буква \"ь\"", getIcon('ь')],
    ['ю', "Мала буква \"ю\"", getIcon('ю')],
    ['я', "Мала буква \"я\"", getIcon('я')],

    ['Ґ', "Велика буква \"Ґ\"", getIcon('Ґ')],
    ['Ё', "Велика буква \"Ё\"", getIcon('Ё')],
    ['Ъ', "Велика буква \"Ъ\"", getIcon('Ъ')],
    ['Ы', "Велика буква \"Ы\"", getIcon('Ы')],
    ['Э', "Велика буква \"Э\"", getIcon('Э')],
    ['ґ', "Мала буква \"ґ\"", getIcon('ґ')],
    ['ё', "Мала буква \"ё\"", getIcon('ё')],
    ['ъ', "Мала буква \"ъ\"", getIcon('ъ')],
    ['ы', "Мала буква \"ы\"", getIcon('ы')],
    ['э', "Мала буква \"э\"", getIcon('э')],

    ['"', "Дволапка", getIcon('"')],
    ['\'', "Лапка", getIcon('\'')],
    ['`', "Косолапка", getIcon('`')],

    ['§', "Секція", getIcon('§')],
    ['#', "Мітка", getIcon('#')],
    ['@', "Адреса", getIcon('@')],
    
    ['[', "Відкрита квадратна дужка", getIcon('[')],
    ['+', "Хрестик", getIcon('+')],
    [']', "Закрита квадратна дужка", getIcon(']')],

    ['(', "Відкрита дужка", getIcon('(')],
    ['-', "Риска", getIcon('-')],
    [')', "Закрита дужка", getIcon(')')],

    ['{', "Відкрита фігурна дужка", getIcon('{')],
    ['*', "Зірочка", getIcon('*')],
    ['}', "Закрита фігурна дужка", getIcon('}')],
    
    ['/', "Похила", getIcon('КОСА')],
    ['|', "Стояча", getIcon('|')],
    ['\\', "Обернена похила", getIcon('ОБЕРКОСА')],
    
    ['<', "Менше", getIcon('<')],
    ['=', "Двориска", getIcon('=')],
    ['>', "Більше", getIcon('>')],

    ['∧', "Вище", getIcon('∧')],
    ['¬', "Гачок", getIcon('¬')],
    ['∨', "Нижче", getIcon('∨')],

    ['¯', "Надриска", getIcon('¯')],
    ['~', "Хвиляста", getIcon('~')],
    ['_', "Підриска", getIcon('_')],

    ['₴', "Гривня", getIcon('₴')],
    ['%', "Відсоток", getIcon('%')],
    ['&', "І", getIcon('&')],
    ['∞', "Нескінченність", getIcon('∞')],

    ['ʼ', "Апостроф", getIcon('ʼ')],
    [',', "Кома", getIcon(',')],
    ['.', "Крапка", getIcon('.')],
    ['·', "Міжкрапка", getIcon('·')],
    [':', "Двокрапка", getIcon(':')],
    [';', "Крапкакома", getIcon(';')],
    ['?', "Питання", getIcon('?')],
    ['!', "Оклик", getIcon('!')],

    ['\0',  "TODO"],
    ['\0',  "TODO"],
    [' ', "Пропуск"],
    ['\n', "Міжряд"],
    ['\x7f', "Дія", `<div style="display: flex; align-items: center">${getIcon('ДІЯ_1')}</div>`],
];

const textEncoder = new TextEncoder();

const lines = charDefinitions.map(([char, definition, logo], index) => {
    const columns = [];
    // columns.push(definition);
    if (logo) {
        columns.push(logo);
    } else if (char) {
        if (char.charCodeAt(0) > 32) {
            columns.push(char[0].replaceAll('\n', '').replaceAll('\\', '\\\\').replaceAll('>', '\\>').replaceAll('<', '\\<').replaceAll('[', '\\[').replaceAll('|', '\\|'));
        } else {
            columns.push(definition);
        }
    } else {
        columns.push('');
    }
    columns.push(String(index));
    columns.push(`<small>0ш</small>${index.toString(16).toUpperCase().replaceAll('A', 'А').replaceAll('B', 'Б').replaceAll('C', 'В').replaceAll('D', 'Г').replaceAll('E', 'Д').replaceAll('F', 'Е')}`);
    columns.push(`<small>0д</small>${index.toString(2)}`);
    if (char) {
        let value = String(char.charCodeAt(0));
        const encoded = textEncoder.encode(char[0]);
        if (encoded.length > 1) {
            value = `${value} <small>\\[${encoded.map((c) => c).join(', ')}]</small>`;
        }
        columns.push(`${char && char.charCodeAt(0) > 32 && char[0] !== ' ' && char[0] !== '\n' ? '<code>' + char[0].replaceAll('\n', '').replaceAll('\\', '\\\\').replaceAll('>', '\\>').replaceAll('<', '\\<').replaceAll('[', '\\[').replaceAll('|', '\\|') + '</code> = ' : ''}${value}`);
    } else {
        columns.push('');
    }
    return `|${columns.join(' | ')}|`;
});

const table = lines.join('\n');

fs.writeFileSync('символи.ю8', charDefinitions.map(([char, definition], index) => {
    const encoded = textEncoder.encode(char[0]);
    const name = definition.replaceAll(' ', '_').replaceAll('\"', '');
    const lines = [];
    lines.push(`стала ${name} = ${index};`);
    return lines.join('\n');
}).join('\n'));

fs.writeFileSync('відповідні_символи_юнікоду.ю8', charDefinitions.map(([char, definition], index) => {
    const encoded = textEncoder.encode(char[0]);
    const name = definition.replaceAll(' ', '_').replaceAll('\"', '');
    const lines = [];
    lines.push(`стала ${name} = ${char.charCodeAt(0)};`);
    return lines.join('\n');
}).join('\n'));

fs.writeFileSync('отримати_символ_ю8_з_т32.ю8', charDefinitions.map(([char, definition], index) => {
    const encoded = textEncoder.encode(char[0]);
    const name = definition.replaceAll(' ', '_').replaceAll('\"', '');
    const lines = [];
    lines.push(`якщо символ_КД == символи::${name} {`);
    if (encoded.length === 1) {
        lines.push(`  вихід_першого_байта::вміст = відповідні_символи_юнікоду::${name};`);
        lines.push(`  вихід_розміру::вміст = 1;`);
        lines.push(`  вернути так;`);
    }
    if (encoded.length === 2) {
        lines.push(`  вихід_першого_байта::вміст = п8(п32(192) | (п32(відповідні_символи_юнікоду::${name}) >> 6));`);
        lines.push(`  вихід_другого_байта::вміст = п8(п32(128) | (п32(відповідні_символи_юнікоду::${name}) & 63));`);
        lines.push(`  вихід_розміру::вміст = 2;`);
        lines.push(`  вернути так;`);
    }
    if (encoded.length === 3) {
        lines.push(`  вихід_першого_байта::вміст = п8(п32(224) | (п32(відповідні_символи_юнікоду::${name}) >> 12));`);
        lines.push(`  вихід_другого_байта::вміст = п8(п32(128) | ((п32(відповідні_символи_юнікоду::${name}) >> 6) & 63));`);
        lines.push(`  вихід_третього_байта::вміст = п8(п32(128) | (п32(відповідні_символи_юнікоду::${name}) & 63));`);
        lines.push(`  вихід_розміру::вміст = 3;`);
        lines.push(`  вернути так;`);
    }
    lines.push(`}`);
    return lines.join('\n');
}).join('\n'));

fs.writeFileSync('отримати_символ_т8_з_ю32.ю8', charDefinitions.map(([char, definition], index) => {
    const name = definition.replaceAll(' ', '_').replaceAll('\"', '');
    const lines = [];
    lines.push(`якщо символ_Ю32 == відповідні_символи_юнікоду::${name} {`);
    lines.push(`  вихід_першого_байта::вміст = символи::${name};`);
    lines.push(`  вихід_розміру::вміст = 1;`);
    lines.push(`  вернути так;`);
    lines.push(`}`);
    return lines.join('\n');
}).join('\n'));

console.log(`# Кодування Д Буквальне

| Символ                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  | Код | 0ш                  | 0д                       | Unicode                                               |
|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-----|---------------------|--------------------------|-------------------------------------------------------|
${table}

---

Додаткові можливості з використанням коду Дії (127):

- Код Дії означає, що наступний код є вказівкою (до прикладу змінити колір тексту).
- Вказівка 0 означає початок (якщо це десь необхідно).
- Вказівка 126 означає перехід до наступного ряду вказівок (відповідно очікується, що наступний код також буде вказівкою).
- Вказівка 127 (два коди Дії підряд) означає кінець (якщо це десь необхідно).
 
`);

// const charset = charDefinitions.map(([char]) => char[0]).filter((char) => char && char !== '\n').join('');
// console.log(charset);